## Checking weird data: ISSUES illustrated with 2017-03-01 data

In [1]:
%matplotlib inline
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import numpy as np
from importlib import reload

In [2]:
import RunDailyEtapasBuilder

Enter the date to analyze: 2017-03-01
Enter the vehicle to analyze: BUS
Consider ZP in perfiles file (0/1)?: 0

In [3]:
etapas_df = RunDailyEtapasBuilder.loadSimplifiedEtapas()
merged_df = RunDailyEtapasBuilder.mergeTurnstileData(etapas_df)
clean_df = RunDailyEtapasBuilder.cleanDataFrame(merged_df)
sorted_df = RunDailyEtapasBuilder.sortDataFrame(clean_df)
sorted_df = sorted_df.reset_index()

Not found in turnstile database: 1614656

* **1st ISSUE**: ADJACENT ROWS WITH SAME sitio_subida, SAME par_subida, SAME servicio_subida BUT CLEARLY DIFFERENT EXPEDITIONS. 
* **SEE BELOW FOR AN EXAMPLE (row 87029 - row 87030)**
* The solution to this would be to include id_expedicion from perfiles database. Currently, this solution is computationally expensive.

In [4]:
sorted_df[((sorted_df['par_subida']=='T-20-68-SN-23')&(sorted_df['servicio_subida']=='T536 00I')&(sorted_df['sitio_subida']=='BFKC-36'))]

,index,id,nviaje,tipo_transporte,t_subida,servicio_subida,par_subida,sitio_subida,fecha_instalacion
86981,1582151,3167969406,4,BUS,2017-03-01 16:50:30,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87025,758948,1629661130,2,BUS,2017-03-01 21:46:46,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87026,1852337,3541945211,3,BUS,2017-03-01 21:46:55,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87027,2009097,3609059560,3,BUS,2017-03-01 21:46:57,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87028,1415182,2797037342,2,BUS,2017-03-01 21:47:00,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87029,928665,2131998184,2,BUS,2017-03-01 21:47:02,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87030,105057,55729378,2,BUS,2017-03-01 23:34:41,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87031,1737658,3323949982,2,BUS,2017-03-01 23:34:41,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87032,679232,1363181444,1,BUS,2017-03-01 23:34:44,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87033,279569,246728342,2,BUS,2017-03-01 23:34:45,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02
87034,76747,49524754,3,BUS,2017-03-01 23:34:47,T536 00I,T-20-68-SN-23,BFKC-36,2017-05-02

* **2nd ISSUE**: ADJACENT ROWS WITH SAME sitio_subida, SAME par_subida, SAME servicio_subida AND ORIGINAL METHODOLOGY PROBLEMS
* **SEE BELOW FOR AN EXAMPLE (row 12425 - row 12426)**
* CURRENTLY THERE ARE NO SOLUTIONS TO THESE CASES

In [5]:
sorted_df.iloc[12423:12428]

,index,id,nviaje,tipo_transporte,t_subida,servicio_subida,par_subida,sitio_subida,fecha_instalacion
12423,1120301,2504471726,1,BUS,2017-03-01 09:59:27,T429 00R,L-18-18-60-NS,BBZX-45,NaT
12424,1390158,2783321502,1,BUS,2017-03-01 10:00:35,T429 00R,L-18-18-60-NS,BBZX-45,NaT
12425,1902370,3562773982,1,BUS,2017-03-01 10:05:31,T429 00R,T-32-316-OP-30,BBZX-45,NaT
12426,48060,28537122,1,BUS,2017-03-01 10:16:20,T429 00R,T-32-316-OP-30,BBZX-45,NaT
12427,1118297,2504268414,1,BUS,2017-03-01 10:16:23,T429 00R,T-32-316-OP-30,BBZX-45,NaT